openFoamRepoDev/tutorials/heatTransfer/chtMultiRegionFoam/externalSolarLoad/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

    // solid
    {
        name    solid;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (15.5  15.5 0)(24.5 24.5 9);
    }

    // floor
    {
        name    floor;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0  0 -2)(41 41 0);
    }

    {
        name    floor;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     floor;
    }

    //air
    {
        name    solid;
        type    cellSet;
        action  invert;
    }

    {
        name    solid;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     floor;
    }

    {
        name    air;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     solid;           // cellSet
    }

    {
        name    cavity;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (17  17 0)(23 23 7.5);
    }

    //- Define again solid
    {
        name    solidCells;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (15.5  15.5 0)(24.5 24.5 9);
    }

    {
        name    solidCells;
        type    cellSet;
        action  subtract;
        source  cellToCell;
        set     cavity;
    }

    {
        name    solid;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     solidCells;     // cellSet
    }
);


// ************************************************************************* //
